kamswierk/CH554_GT911/Core/Src/ch554_usb.c
#include "stdio.h"
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "ch554_usb.h"
#include "debug.h"
#include "delay.h"

#define THIS_ENDP0_SIZE         64
#define UsbSetupBuf     		((PUSB_SETUP_REQ)Ep0Buffer)


__xdata __at (0x0000) uint8_t  Ep0Buffer[THIS_ENDP0_SIZE];      			   // Endpoint 0 OUT & IN buffer, must be an even address
__xdata __at (0x0080) uint8_t  Ep2Buffer[2*THIS_ENDP0_SIZE];                   // Endpoint 2 IN & OUT buffer, must be an even address

USB_DigitizerReport_Data_t DigitizerReportData;
USB_DigitizerReport_t  DigitizerReport;

volatile uint16_t SetupLen;
volatile uint16_t remainingLength;
uint8_t SetupReq, Count, UsbConfig, FLAG, Ready;
const uint8_t *  pDescr;                                                       //USB configuration flag
USB_SETUP_REQ   SetupReqBuf;                                                   //Temporary Setup package


__code uint8_t DevDesc[18] = {0x12,0x01,0x01,0x00,0x00,0x00,0x00,THIS_ENDP0_SIZE,
                      0x86,0x1a,0xe3,0xe5,0x00,0x00,0x01,0x02,
                      0x00,0x01
                     };

void CreateReport(USB_DigitizerReport_t* Report)
{
	Report->ReportId = 0x01;
	Report->Data = DigitizerReportData;
}

uint8_t FeatureReport[] = {0x02, 0x05}; // ReportID:2 MaxContactPoints:5


__code uint8_t CfgDesc[34] =
{
	/* Configuration descriptor - 9 bytes */
    0x09,0x02,0x22,0x00,0x01,0x01,0x00,0xa0,0x32,
	/* Interface descriptor - 9 bytes */
    0x09,0x04,0x00,0x00,0x01,0x03,0x00,0x00,0x00,
	/* HID descriptor - 9 bytes */
    0x09,0x21,0x00,0x01,0x00,0x01,0x22,0x89,0x01,				// last 2 bytes (0x89 0x01 is report size which is 393 in DEC)
	/* Endpoint descriptor - 7 bytes */
    0x07,0x05,0x82,0x03,THIS_ENDP0_SIZE,0x00,0x01,

};


__code uint8_t	MyLangDescr[] = { 0x04, 0x03, 0x09, 0x04 };

__code uint8_t	MyManuInfo[] = { 0x0E, 0x03, 'w', 0, 'c', 0, 'h', 0, '.', 0, 'c', 0, 'n', 0 };

__code uint8_t	MyProdInfo[] = { 0x0C, 0x03, 'C', 0, 'H', 0, '5', 0, '5', 0, '4', 0 };


__code const USB_Descriptor_HIDReport_Datatype_t HIDRepDesc[] =
{
	0x05, 0x0D, 			// Usage Page (Digitizer)
	0x09, 0x04, 			// Usage (Touch Screen)
	0xA1, 0x01, 			// Collection (Application)
	0x85, 0x01, 			//     Report ID (1)
	0x09, 0x22, 			//     Usage (Finger)
	0xA1, 0x02, 			//     Collection (Logical)
	0x05, 0x0D, 			//         Usage Page (Digitizer)
	0x09, 0x42, 			//         Usage (Tip Switch)
	0x09, 0x32, 			//         Usage (In Range)
	0x15, 0x00, 			//         Logical Minimum (0)
	0x25, 0x01, 			//         Logical Maximum (1)
	0x95, 0x02, 			//         Report Count (2)
	0x75, 0x01, 			//         Report Size (1)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x95, 0x06, 			//         Report Count (6)
	0x81, 0x03, 			//         Input (Cnst,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x09, 0x51, 			//         Usage (Contact Identifier)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x08, 			//         Report Size (8)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x05, 0x01, 			//         Usage Page (Generic Desktop)
	0x26, 0xFF, 0x07,       //         Logical Maximum (2047)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x10, 			//         Report Size (16)
	0x55, 0x0E, 			//         Unit Exponent (-2)
	0x65, 0x11, 			//         Unit (SI Lin: Length (cm))
	0x09, 0x30, 			//         Usage (X)
	0x35, 0x00, 			//         Physical Minimum (0)
	0x46, 0xB1, 0x08, 	    //         Physical Maximum (2225)
	0x81, 0x02, 		   	//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x46, 0xE3, 0x04, 	    //         Physical Maximum (1251)
	0x09, 0x31, 			//         Usage (Y)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0xC0,                   //     End Collection
	0xA1, 0x02, 			//     Collection (Logical)
	0x05, 0x0D, 			//         Usage Page (Digitizer)
	0x09, 0x42, 			//         Usage (Tip Switch)
	0x09, 0x32, 			//         Usage (In Range)
	0x15, 0x00, 			//         Logical Minimum (0)
	0x25, 0x01, 			//         Logical Maximum (1)
	0x95, 0x02, 			//         Report Count (2)
	0x75, 0x01, 			//         Report Size (1)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x95, 0x06, 			//         Report Count (6)
	0x81, 0x03, 			//         Input (Cnst,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x09, 0x51, 			//         Usage (Contact Identifier)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x08, 			//         Report Size (8)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x05, 0x01, 			//         Usage Page (Generic Desktop)
	0x26, 0xFF, 0x07,       //         Logical Maximum (2047)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x10, 			//         Report Size (16)
	0x55, 0x0E, 			//         Unit Exponent (-2)
	0x65, 0x11, 			//         Unit (SI Lin: Length (cm))
	0x09, 0x30, 			//         Usage (X)
	0x35, 0x00, 			//         Physical Minimum (0)
	0x46, 0xB1, 0x08, 	    //         Physical Maximum (2225)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x46, 0xE3, 0x04, 	    //         Physical Maximum (1251)
	0x09, 0x31, 			//         Usage (Y)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0xC0,                   //     End Collection
	0xA1, 0x02, 			//     Collection (Logical)
	0x05, 0x0D, 			//         Usage Page (Digitizer)
	0x09, 0x42, 			//         Usage (Tip Switch)
	0x09, 0x32, 			//         Usage (In Range)
	0x15, 0x00, 			//         Logical Minimum (0)
	0x25, 0x01, 			//         Logical Maximum (1)
	0x95, 0x02, 			//         Report Count (2)
	0x75, 0x01, 			//         Report Size (1)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x95, 0x06, 			//         Report Count (6)
	0x81, 0x03, 			//         Input (Cnst,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x09, 0x51, 			//         Usage (Contact Identifier)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x08, 			//         Report Size (8)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x05, 0x01, 			//         Usage Page (Generic Desktop)
	0x26, 0xFF, 0x07,       //         Logical Maximum (2047)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x10, 			//         Report Size (16)
	0x55, 0x0E, 			//         Unit Exponent (-2)
	0x65, 0x11, 			//         Unit (SI Lin: Length (cm))
	0x09, 0x30, 			//         Usage (X)
	0x35, 0x00, 			//         Physical Minimum (0)
	0x46, 0xB1, 0x08, 	    //         Physical Maximum (2225)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x46, 0xE3, 0x04, 	    //         Physical Maximum (1251)
	0x09, 0x31, 			//         Usage (Y)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0xC0,                   //     End Collection
	0xA1, 0x02, 			//     Collection (Logical)
	0x05, 0x0D, 			//         Usage Page (Digitizer)
	0x09, 0x42, 			//         Usage (Tip Switch)
	0x09, 0x32, 			//         Usage (In Range)
	0x15, 0x00, 			//         Logical Minimum (0)
	0x25, 0x01, 			//         Logical Maximum (1)
	0x95, 0x02, 			//         Report Count (2)
	0x75, 0x01, 			//         Report Size (1)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x95, 0x06, 			//         Report Count (6)
	0x81, 0x03, 			//         Input (Cnst,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x09, 0x51, 			//         Usage (Contact Identifier)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x08, 			//         Report Size (8)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x05, 0x01, 			//         Usage Page (Generic Desktop)
	0x26, 0xFF, 0x07,       //         Logical Maximum (2047)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x10, 			//         Report Size (16)
	0x55, 0x0E, 			//         Unit Exponent (-2)
	0x65, 0x11, 			//         Unit (SI Lin: Length (cm))
	0x09, 0x30, 			//         Usage (X)
	0x35, 0x00, 			//         Physical Minimum (0)
	0x46, 0xB1, 0x08, 	    //         Physical Maximum (2225)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x46, 0xE3, 0x04, 	    //         Physical Maximum (1251)
	0x09, 0x31, 			//         Usage (Y)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0xC0,                   //     End Collection
	0xA1, 0x02, 			//     Collection (Logical)
	0x05, 0x0D, 			//         Usage Page (Digitizer)
	0x09, 0x42, 			//         Usage (Tip Switch)
	0x09, 0x32, 			//         Usage (In Range)
	0x15, 0x00, 			//         Logical Minimum (0)
	0x25, 0x01, 			//         Logical Maximum (1)
	0x95, 0x02, 			//         Report Count (2)
	0x75, 0x01, 			//         Report Size (1)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x95, 0x06, 			//         Report Count (6)
	0x81, 0x03, 			//         Input (Cnst,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x09, 0x51, 			//         Usage (Contact Identifier)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x08, 			//         Report Size (8)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x05, 0x01, 			//         Usage Page (Generic Desktop)
	0x26, 0xFF, 0x07,       //         Logical Maximum (2047)
	0x95, 0x01, 			//         Report Count (1)
	0x75, 0x10, 			//         Report Size (16)
	0x55, 0x0E, 			//         Unit Exponent (-2)
	0x65, 0x11, 			//         Unit (SI Lin: Length (cm))
	0x09, 0x30, 			//         Usage (X)
	0x35, 0x00, 			//         Physical Minimum (0)
	0x46, 0xB1, 0x08, 	    //         Physical Maximum (2225)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x46, 0xE3, 0x04, 	    //         Physical Maximum (1251)
	0x09, 0x31, 			//         Usage (Y)
	0x81, 0x02, 			//         Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0xC0,                   //   End Collection
	0x05, 0x0D, 			//     Usage Page (Digitizer)
	0x09, 0x54, 			//     Usage (Contact Count)
	0x95, 0x01, 			//     Report Count (1)
	0x75, 0x08, 			//     Report Size (8)
	0x25, 0x05, 			//     Logical Maximum (5)
	0x81, 0x02, 			//     Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0x85, 0x02, 			//     Report ID (2)
	0x09, 0x55, 			//     Usage (Contact Count Maximum)
	0xB1, 0x02, 			//     Feature (Data,Var,Abs,NWrp,Lin,Pref,NNul,NVol,Bit)
	0xC0,                   // End Collection
	0x05, 0x0C, 			// Usage Page (Consumer Devices)
	0x09, 0x01, 			// Usage (Consumer Control)
	0xA1, 0x01, 			// Collection (Application)
	0x85, 0x04, 			//     Report ID (4)
	0x95, 0x01, 			//     Report Count (1)
	0x75, 0x10, 			//     Report Size (16)
	0x16, 0x00, 0x00, 	    //     Logical Minimum (0)
	0x26, 0x9C, 0x02, 	    //     Logical Maximum (668)
	0x05, 0x0C, 			//     Usage Page (Consumer Devices)
	0x1A, 0x00, 0x00, 	    //     Usage Minimum (Undefined)
	0x2A, 0x9C, 0x02, 	    //     Usage Maximum (AC Distribute Vertically)
	0x81, 0x00, 			//     Input (Data,Ary,Abs)
	0xC0,                   // End Collection
	0x05, 0x01, 			// Usage Page (Generic Desktop)
	0x09, 0x80, 			// Usage (System Control)
	0xA1, 0x01, 			// Collection (Application)
	0x85, 0x05, 			//     Report ID (5)
	0x75, 0x01, 			//     Report Size (1)
	0x95, 0x08, 			//     Report Count (8)
	0x15, 0x00, 			//     Logical Minimum (0)
	0x25, 0x01, 			//     Logical Maximum (1)
	0x09, 0x81, 			//     Usage (System Power Down)
	0x09, 0x82, 			//     Usage (System Sleep)
	0x09, 0x83, 			//     Usage (System Wake Up)
	0x09, 0x84, 			//     Usage (System Context Menu)
	0x09, 0x85, 			//     Usage (System Main Menu)
	0x09, 0x86, 			//     Usage (System App Menu)
	0x09, 0x87, 			//     Usage (System Menu Help)
	0x09, 0x88, 			//     Usage (System Menu Exit)
	0x81, 0x02, 			//     Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit)
	0xC0,                   // End Collection
};



///* USB Device mode configuration */
void USBDeviceCfg(void)
{
    USB_CTRL = 0x00;                                                           // Clear USB control register
    USB_CTRL &= ~bUC_HOST_MODE;                                                // This bit selects the device mode
    USB_CTRL |=  bUC_DEV_PU_EN | bUC_INT_BUSY | bUC_DMA_EN;                    // USB device and internal pull-up enable, automatically return to NAK before interrupt flag is cleared, USB DMA enabled
    USB_DEV_AD = 0x00;                                                         // Device address initialization
    //     USB_CTRL |= bUC_LOW_SPEED;
    //     UDEV_CTRL |= bUD_LOW_SPEED;                                         // Select low speed 1.5M mode
    USB_CTRL &= ~bUC_LOW_SPEED;
    UDEV_CTRL &= ~bUD_LOW_SPEED;                                               // Select full speed 12M mode, the default mode
    UDEV_CTRL = bUD_PD_DIS;                                                    // Disable DP / DM pull-down resistor
    UDEV_CTRL |= bUD_PORT_EN;                                                  // Enable physical port
}


///* USB interrupt in Device mode initialization */
void USBDeviceIntCfg(void)
{
    USB_INT_EN |= bUIE_SUSPEND;                                                // Enable device suspend interrupt
    USB_INT_EN |= bUIE_TRANSFER;                                               // Enable USB transfer completion interrupt
    USB_INT_EN |= bUIE_BUS_RST;                                                // Enable device mode USB bus reset interrupt
    USB_INT_FG |= 0x1F;                                                        // Clear interrupt flag
    IE_USB = 1;                                                                // Enable USB interrupt
}

