kamswierk/CH554_GT911/Core/Src/ch554_usb.c
///* USB device mode endpoint configuration, simulation compatible HID device, in addition to endpoint 0 control transmission, also includes endpoint 2 batch upload */
void USBDeviceEndPointCfg(void)
{
    UEP2_DMA = (uint16_t) Ep2Buffer;                                             // Endpoint 2 IN data transfer address
    UEP2_3_MOD |= bUEP2_TX_EN | bUEP2_RX_EN;                                   //�˵�2���ͽ���ʹ��
    UEP2_3_MOD &= ~bUEP2_BUF_MOD;                                              //�˵�2�շ���64�ֽڻ�����
    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;                 //�˵�2�Զ���תͬ����־λ��IN���񷵻�NAK��OUT����ACK                              // Endpoint 2 auto Toggle flag, IN trans return NAK



    UEP0_DMA = (uint16_t) Ep0Buffer;                                                      // Endpoint 0 data transfer address
    UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;                                 // Manual flip, OUT transaction returns ACK, IN transaction returns NAK
}


bool (* __xdata createHIDHandler)(USB_DigitizerReport_Data_t*);

void USB_setHIDCreateHandler(bool (* __xdata handler)(USB_DigitizerReport_Data_t*)) {
	createHIDHandler = handler;
}


void Enp2BulkIn(void)
{
	createHIDHandler(&DigitizerReportData);
	CreateReport(&DigitizerReport);

    memcpy( Ep2Buffer+MAX_PACKET_SIZE, &DigitizerReport, sizeof(USB_DigitizerReport_t));

    UEP2_T_LEN = sizeof(USB_DigitizerReport_t);
    UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK;
    while(( UEP2_CTRL & MASK_UEP_T_RES ) == UEP_T_RES_ACK);                  			// Waiting upload complete, avoid overwriting


}




void DeviceInterrupt(void) __interrupt (INT_NO_USB)
{
	uint16_t len;                                                               // USB receiving length
	uint8_t i;

	if(UIF_TRANSFER)		                                                    // USB transfer completion interrupt flag
	{
		switch(USB_INT_ST & (MASK_UIS_TOKEN | MASK_UIS_ENDP))                   // Process transfer according to current endpoint number(MASK_UIS_ENDP) and current transaction token PID identifier(MASK_UIS_TOKEN)
		{                                                                       // (00xx xxxx & (0011 0000 | 0000 1111))
			case UIS_TOKEN_IN | 2:											    // Process IN(transmission) on Endpoint 2
			{
	            UEP2_T_LEN = 0;                                                    //Ԥʹ�÷��ͳ���һ��Ҫ���
//	            UEP2_CTRL ^= bUEP_T_TOG;                                          //����������Զ���ת����Ҫ�ֶ���ת
	            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_NAK;           //Ĭ��Ӧ��NAK
				break;
			}
			case UIS_TOKEN_OUT | 2:											    // Process OUT(reception) on Endpoint 2
			{
				if (U_TOG_OK)                                                   // Reject unsynchronized packets
				{
	                len = USB_RX_LEN;                                           // Read the quantity of bytes of the data received by the current USB endpoint and write to len variable
	                for ( i = 0; i < len; i ++ )
	                {
	                    Ep2Buffer[MAX_PACKET_SIZE+i] = Ep2Buffer[i] ^ 0xFF;     // OUT data are changed to IN data (^ bitwise XOR)֤
	                }
	                UEP2_T_LEN = len;                                           // Write len value to register where Endpoint 2 transmittal data length is stored
	                UEP2_CTRL = (UEP2_CTRL & (~MASK_UEP_R_RES)) | UEP_T_RES_ACK;// Data ready, expected ACK
				}
				break;
			}
			case UIS_TOKEN_SETUP | 0:                                           // Process SETUP on Endpoint 0
			{
				len = USB_RX_LEN;												// Read the quantity of bytes of the data received by the current USB endpoint and write to len variable
				if(len == (sizeof(USB_SETUP_REQ)))                              // Check if received data lenght has 8 bytes of standard Setup packet
				{
//					SetupLen = UsbSetupBuf->wLengthL;                           // Save in global variable SetupLen number of bytes requested in Setup packet to transfer in data phase (response)
					SetupLen = ((((uint16_t)(UsbSetupBuf->wLengthH)) << 8) | (UsbSetupBuf->wLengthL)) ;
					len = 0;													// Set default length to 0
					SetupReq = UsbSetupBuf->bRequest;                           // Save in global variable SetupReq code of request from Setup packet
					if ((UsbSetupBuf->bRequestType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD) 	// Handle NOT standard device requests
	                {
						switch(SetupReq)
						{
							case HID_GET_REPORT:                                // Handle class specific GET_REPORT request (host receive report via control pipe)
							{
								pDescr = FeatureReport;
								len = sizeof(FeatureReport);
								break;
							}
							case HID_GET_IDLE:                                  // Handle class specific GET_IDLE request - ignore
							{
								break;
							}
							case HID_GET_PROTOCOL:                              // Handle class specific GET_PROTOCOL request - ignore
							{
								break;
							}
							case HID_SET_REPORT:                                // Handle class specific SET_REPORT request - ignore
							{
								break;
							}
							case HID_SET_IDLE:                                  // Handle class specific SET_IDLE request - ignore
							{
								break;
							}
							case HID_SET_PROTOCOL:                              // Handle class specific GET_PROTOCOL request - ignore
							{
								break;
	                		}
							default:											// Unknown class specific request
							{
								len = 0xFF;
								break;
							}
						}
						if(SetupLen > len)
						{
							SetupLen = len;                                     // Limitation of total length
						}
						len = SetupLen >= THIS_ENDP0_SIZE ? THIS_ENDP0_SIZE : SetupLen;   		// Set transmission length
						memcpy(Ep0Buffer,pDescr,len);                           // Load the transmission data
						SetupLen -= len;
						pDescr += len;
	                }
					else 															// Handle standard host to device requests
					{
						switch(SetupReq)										// Request code for standard host to device request type
						{
							case USB_GET_DESCRIPTOR:							// Handle standard host to device GET_DESCRIPTOR request
							{
								switch(UsbSetupBuf->wValueH)
								{
									case USB_DESCR_TYP_DEVICE:					// When host requests for Device Descriptor
										pDescr = DevDesc;
										len = sizeof(DevDesc);
										break;
									case USB_DESCR_TYP_CONFIG:					// When host requests for Configuration Descriptor
										pDescr = CfgDesc;
										len = sizeof(CfgDesc);
										break;
									case USB_DESCR_TYP_STRING:
	                                {
	                                    switch(UsbSetupBuf->wValueL)
	                                    {
	                                        case 1:
	                                            pDescr = MyManuInfo;
	                                            len = sizeof(MyManuInfo);
	                                            break;
	                                        case 2:
	                                            pDescr = MyProdInfo;
	                                            len = sizeof(MyProdInfo);
	                                            break;
	                                        case 0:
	                                            pDescr = MyLangDescr;
	                                            len = sizeof(MyLangDescr);
	                                            break;
	                                        default:
	                                            len = 0xFF;                               // ��֧�ֵ��ַ���������
	                                            break;
	                                    }
	                                    break;
	                                }
			                        case USB_DESCR_TYP_REPORT:					// When host requests for HID Report Descriptor
//			                            printf("Report Deskyryptor request\n\r");
			                        	pDescr = HIDRepDesc;
			                            len = sizeof(HIDRepDesc);
			                            break;
			                        default:
			                            len = 0xFF;                             // Unsupported descriptor type or error
			                            break;
								}
								if(SetupLen > len)
								{
									SetupLen = len;			                    // If requested data length to be sent in response is greater than actual descriptor size - limit it to decsriptor size
								}
								len = SetupLen >= THIS_ENDP0_SIZE ? THIS_ENDP0_SIZE : SetupLen;
									memcpy(Ep0Buffer,pDescr,len);
									SetupLen -= len;
									pDescr +=len;
								break;
							} /* case USB_GET_DESCRIPTOR */
							case USB_SET_ADDRESS:                               // Handle standard host to device SET_ADDRESS request
								SetupLen = UsbSetupBuf->wValueL;                // Save the device address but why in SetupLen?
								break;
							case USB_GET_CONFIGURATION:							// Handle standard host to device GET_CONFIGURATION request
								Ep0Buffer[0] = UsbConfig;
								if(SetupLen >= 1)
								{
									len = 1;
								}
								break;
							case USB_SET_CONFIGURATION:							// Handle standard host to device GET_CONFIGURATION request
								UsbConfig = UsbSetupBuf->wValueL;
								if(UsbConfig)
								{
									Ready = 1;
								}
								break;
							case USB_GET_INTERFACE:								// Handle standard host to device GET_INTERFACE request
								break;
							case USB_CLEAR_FEATURE:								// Handle standard host to device CLEAR_FEATURE request
		                        if((UsbSetupBuf->bRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)  // Checks if a request Recipient is Endpoint
		                        {
		                            switch(UsbSetupBuf->wIndexL)				// Clear Endpoint 1 IN and Endpoint 2 IN and OUT
		                            {
		                            case 0x82:
		                                UEP2_CTRL = (UEP2_CTRL & ~( bUEP_T_TOG | MASK_UEP_T_RES)) | UEP_T_RES_NAK;
		                                break;
		                            case 0x81:
		                                UEP1_CTRL = (UEP1_CTRL & ~( bUEP_T_TOG | MASK_UEP_T_RES)) | UEP_T_RES_NAK;
		                                break;
		                            case 0x02:
		                                UEP2_CTRL = (UEP2_CTRL & ~( bUEP_R_TOG | MASK_UEP_R_RES)) | UEP_R_RES_ACK;
		                                break;
		                            default:
		                                len = 0xFF;                             // No such endpoint - error
		                                break;
		                            }
		                        }
		                        else
		                        {
		                            len = 0xFF;                                 // Recipient different than endpoint
		                        }
		                        break;
							case USB_SET_FEATURE:								// Handle standard host to device SET_FEATURE request
		                        if((UsbSetupBuf->bRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE)  // Checks if a request Recipient is Device
		                        {
		                            if((((uint16_t)UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) == 0x01)
		                            {
		                                if( CfgDesc[7] & 0x20 ) 				// Only if Remote Wakeup bit in bmAttributes has been selected in Configuration Descriptor
		                                {
		                                    /* Awake the device */
		                                }
		                                else
		                                {
		                                    len = 0xFF;                         // Error routing - Rmote Wakeup not enabled in Configuration Descriptor
		                                }
		                            }
		                            else
		                            {
		                                len = 0xFF;                             // Error routing - unknown feature to set
		                            }
		                        }
		                        else if((UsbSetupBuf->bRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP)  // Checks if a request Recipient is Endpoint
		                        {
		                            if((((uint16_t)UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) == 0x00)   // Checks if the command is 0x00(ENDPOINT_HALT)
		                            {
		                                switch(((uint16_t)UsbSetupBuf->wIndexH << 8) | UsbSetupBuf->wIndexL)
		                                {
		                                case 0x82:
		                                    UEP2_CTRL = (UEP2_CTRL & (~bUEP_T_TOG)) | UEP_T_RES_STALL;			// Endpoint 2 IN STALL
		                                    break;
		                                case 0x02:
		                                    UEP2_CTRL = (UEP2_CTRL & (~bUEP_R_TOG)) | UEP_R_RES_STALL;          // Endpoint 2 OUT STALL
		                                    break;
		                                case 0x81:
		                                    UEP1_CTRL = (UEP1_CTRL & (~bUEP_T_TOG)) | UEP_T_RES_STALL;			// Endpoint 1 IN STALL
		                                    break;
		                                default:
		                                    len = 0xFF;                         // No such endpoint - error
		                                    break;
		                                }
		                            }
		                            else
		                            {
		                                len = 0xFF;                             // Not supported command for Endpoint recipient
		                            }
		                        }
		                        else											// We support only SET_FEATURE request for Device and Endpoint Recipient
		                        {
		                            len = 0xFF;
		                        }
		                        break;
							case USB_GET_STATUS:								// Handle standard device GET_STATUS request. Device must return 2 bytes
		                        Ep0Buffer[0] = 0x00;							// Device is bus powered
		                        Ep0Buffer[1] = 0x00;							// Device has remote Wake-up disabled
		                        if (SetupLen >= 2)
		                        {
		                            len = 2;									// Device is returning only 2 bytes, not more
		                        }
		                        else
		                        {
		                            len = SetupLen;
		                        }
		                        break;
							default:
								len = 0xFF;
								break;

