kamswierk/CH554_GT911/Core/Src/ch554_usb.c
						}
					}
				} // end if(len == (sizeof(USB_SETUP_REQ)))
				else															//Setup packet length error
				{
					len = 0xFF;
				}

	            if(len == 0xFF)
	            {
	                SetupReq = 0xFF;
	                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_STALL | UEP_T_RES_STALL;//STALL
	            }
	            else if(len <= THIS_ENDP0_SIZE)//上传数据或者状态阶段返回0长度包
	            {
	                UEP0_T_LEN = len;
	                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA1，返回应答ACK
	            }
	            else
	            {
	                UEP0_T_LEN = 0;  //虽然尚未到状态阶段，但是提前预置上传0长度数据包以防主机提前进入状态阶段
	                UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK;//默认数据包是DATA1,返回应答ACK
	            }
	            break;
			}
			case UIS_TOKEN_IN | 0:
            	switch(SetupReq)
            	{
				case USB_GET_DESCRIPTOR:
				case HID_GET_REPORT:
					len = SetupLen >= THIS_ENDP0_SIZE ? THIS_ENDP0_SIZE : SetupLen;                                 //本次传输长度
//					len = SetupLen >= THIS_ENDP0_SIZE ? DEFAULT_ENDP0_SIZE : SetupLen;
					memcpy( Ep0Buffer, pDescr, len );                                   //加载上传数据
					SetupLen -= len;
//					printf("Setup len in: %d, len: %d\n\r", SetupLen, len);
					pDescr += len;
					UEP0_T_LEN = len;
					UEP0_CTRL ^= bUEP_T_TOG;                                             //同步标志位翻转
					break;
				case USB_SET_ADDRESS:
					USB_DEV_AD = USB_DEV_AD & bUDA_GP_BIT | SetupLen;
					UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
					break;
				default:
					UEP0_T_LEN = 0;                                                      //状态阶段完成中断或者是强制上传0长度数据包结束控制传输
					UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
					break;
				}
				break;
            case UIS_TOKEN_OUT | 0:  // endpoint0 OUT
				len = USB_RX_LEN;
				if(SetupReq == 0x09)
				{
					if(Ep0Buffer[0])
					{
//						printf("Light on Num Lock LED!\n");
					}
					else if(Ep0Buffer[0] == 0)
					{
//						printf("Light off Num Lock LED!\n");
					}
				}
				UEP0_CTRL ^= bUEP_R_TOG;                                     //ͬ����־λ��ת
				break;
            default:
            	break;
			}
			UIF_TRANSFER = 0;
		}
		if(UIF_BUS_RST)                                                         // Interrupt flag in USB device mode triggered by USB bus reset event
		{
			UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;                          // Configures endpoint 0 control register to acknowledge reception (UEP_R_RES_ACK) and indicate no data to be transmitted (UEP_T_RES_NAK)
			UEP1_CTRL = bUEP_AUTO_TOG | UEP_R_RES_NAK;                          // Configures endpoint 1 control register to enable automatic toggle (bUEP_AUTO_TOG) and indicate no reception (UEP_R_RES_NAK)
			UEP2_CTRL = bUEP_AUTO_TOG | UEP_R_RES_ACK | UEP_T_RES_NAK;          // Configures endpoint 2 control register to enable automatic toggle, acknowledge reception, and indicate no data to be transmitted
			USB_DEV_AD = 0x00;                                                  // Sets the USB device address to 0
			UIF_SUSPEND = 0;                                                    // Clears the USB suspend flag
			UIF_TRANSFER = 0;                                                   // Clears the USB transfer flag
	        Ready = 0;
			UIF_BUS_RST = 0;                                                    // Clear this interrupt flag
		}
		if (UIF_SUSPEND)                                                        // USB Suspended and Awake interrupt
		{
			UIF_SUSPEND = 0;                                                    // Clear this interrupt flag
			if ( USB_MIS_ST & bUMS_SUSPEND )                                    // Checking if suspend flag is present
			{
//				while ( XBUS_AUX & bUART0_TX )
//				{
//					;                                                           // Wait for UART0 transmission to be completed
//				}
//				SAFE_MOD = 0x55;                                                // Send 0x55 then 0xAA to enter safe mode
//				SAFE_MOD = 0xAA;
//				WAKE_CTRL = bWAK_BY_USB | bWAK_RXD0_LO | bWAK_RXD1_LO;          // Enable waking up by action on USB Bus or RXD0 low level
//				PCON |= PD;                                                     // Enter sleep mode bit, auto cleared by hardware after wake-up
//				SAFE_MOD = 0x55;                                                // Send 0x55 then 0xAA to enter safe mode
//				SAFE_MOD = 0xAA;
//				WAKE_CTRL = 0x00;                                               // Disable previously selected wake-up hardware sources
			}
		}
		else {                                                                  // Unexpected interrupt
			USB_INT_FG = 0xFF;                                                  // Reset the interrupt
		}
}
